Dlubal.RFEM5.ScalingDirectionType
Direction of scaling

Dlubal.RFEM5.ScalingDirectionType.UnknownScalingDirection
Unknown scaling direction

Dlubal.RFEM5.ScalingDirectionType.AllDirections
Scaling in all directions

Dlubal.RFEM5.ScalingDirectionType.DefinedDirection
Scaling in defined direction

Dlubal.RFEM5.ScalingDirectionType.DefinedDirectionBy2Points
Scaling in direction defined by two points